nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
/*
    * Copyright 2024 NXP
    *
    * SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MC56F83789
package_id: MC56F83789VLL
mcu_data: ksdk2_0
processor_version: 0.15.1
pin_labels:
- {pin_num: '6', pin_signal: GPIOF8/RXD0/TB1/CMPD_O/PWMA_2X, label: LED_R, identifier: LED_R}
- {pin_num: '57', pin_signal: GPIOF9/RXD2/PWMA_FAULT7/PWMB_FAULT7/XB_OUT11, label: LED_G, identifier: LED_G}
- {pin_num: '3', pin_signal: GPIOC0/EXTAL/CLKIN0, label: EXTAL, identifier: EXTAL}
- {pin_num: '4', pin_signal: GPIOC1/XTAL, label: XTAL, identifier: XTAL}
- {pin_num: '5', pin_signal: GPIOC2/TXD0/TB0/XB_IN2/CLKO0, label: USB_SCI_TX}
- {pin_num: '11', pin_signal: GPIOC3/TA0/CMPA_O/RXD0/CLKIN1, label: USB_SCI_RX}
- {pin_num: '36', pin_signal: GPIOB2/ANB2/VREFHB/CMPC_IN3, label: CUR_DCB}
- {pin_num: '22', pin_signal: GPIOA0/ANA0/CMPA_IN3/CMPC_O, label: CUR_A}
- {pin_num: '23', pin_signal: GPIOA1/ANA1/CMPA_IN0, label: CUR_C}
- {pin_num: '33', pin_signal: GPIOB0/ANB0/CMPB_IN3, label: CUR_B}
- {pin_num: '24', pin_signal: GPIOA2/ANA2/VREFHA/CMPA_IN1, label: VOLT_DCB}
- {pin_num: '42', pin_signal: GPIOB3/ANB3/VREFLB/CMPC_IN0, label: CUR_C}
- {pin_num: '46', pin_signal: GPIOF15/RXD0/XB_IN10, label: SW2, identifier: SW5;SW2}
- {pin_num: '9', pin_signal: GPIOD6/TXD2/XB_IN4/XB_OUT8, label: OSBDM_SCI_TX}
- {pin_num: '10', pin_signal: GPIOD5/RXD2/XB_IN5/XB_OUT9, label: OSBDM_SCI_RX}
- {pin_num: '56', pin_signal: GPIOF10/TXD2/PWMA_FAULT6/PWMB_FAULT6/XB_OUT10, label: LED_B, identifier: LED_B}
- {pin_num: '45', pin_signal: GPIOF11/TXD0/XB_IN11, label: LED_Y, identifier: LED_Y}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "fsl_xbara.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '22', peripheral: ADC, signal: 'ANA, 0', pin_signal: GPIOA0/ANA0/CMPA_IN3/CMPC_O}
  - {pin_num: '23', peripheral: ADC, signal: 'ANA, 1', pin_signal: GPIOA1/ANA1/CMPA_IN0}
  - {pin_num: '24', peripheral: ADC, signal: 'ANA, 2', pin_signal: GPIOA2/ANA2/VREFHA/CMPA_IN1}
  - {pin_num: '33', peripheral: ADC, signal: 'ANB, 0', pin_signal: GPIOB0/ANB0/CMPB_IN3}
  - {pin_num: '42', peripheral: ADC, signal: 'ANB, 3', pin_signal: GPIOB3/ANB3/VREFLB/CMPC_IN0}
  - {pin_num: '5', peripheral: QSCI0, signal: TXD, pin_signal: GPIOC2/TXD0/TB0/XB_IN2/CLKO0}
  - {pin_num: '11', peripheral: QSCI0, signal: RXD, pin_signal: GPIOC3/TA0/CMPA_O/RXD0/CLKIN1}
  - {pin_num: '68', peripheral: PWMA, signal: 'B, 0', pin_signal: GPIOE0/PWMA_0B/XB_OUT4}
  - {pin_num: '69', peripheral: PWMA, signal: 'A, 0', pin_signal: GPIOE1/PWMA_0A/XB_OUT5}
  - {pin_num: '74', peripheral: PWMA, signal: 'B, 1', pin_signal: GPIOE2/PWMA_1B/XB_OUT6}
  - {pin_num: '75', peripheral: PWMA, signal: 'A, 1', pin_signal: GPIOE3/PWMA_1A/XB_OUT7}
  - {pin_num: '82', peripheral: PWMA, signal: 'B, 2', pin_signal: GPIOE4/PWMA_2B/XB_IN2/XB_OUT8}
  - {pin_num: '83', peripheral: PWMA, signal: 'A, 2', pin_signal: GPIOE5/PWMA_2A/XB_IN3/XB_OUT9}
  - {pin_num: '6', peripheral: GPIOF, signal: 'GPIO, 8', pin_signal: GPIOF8/RXD0/TB1/CMPD_O/PWMA_2X, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '57', peripheral: GPIOF, signal: 'GPIO, 9', pin_signal: GPIOF9/RXD2/PWMA_FAULT7/PWMB_FAULT7/XB_OUT11, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '56', peripheral: GPIOF, signal: 'GPIO, 10', pin_signal: GPIOF10/TXD2/PWMA_FAULT6/PWMB_FAULT6/XB_OUT10, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '45', peripheral: GPIOF, signal: 'GPIO, 11', pin_signal: GPIOF11/TXD0/XB_IN11, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL}
  - {peripheral: ADC, signal: 'SYNC, A', pin_signal: PWMA0_OUT_TRIG0}
  - {pin_num: '36', peripheral: CMPC, signal: 'IN, 3', pin_signal: GPIOB2/ANB2/VREFHB/CMPC_IN3}
  - {peripheral: PWMA, signal: 'FAULT, 0', pin_signal: CMPC_OUT}
  - {pin_num: '46', peripheral: GPIOF, signal: 'GPIO, 15', pin_signal: GPIOF15/RXD0/XB_IN10, identifier: SW2, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge}
  - {pin_num: '51', peripheral: TMRB, signal: 'IN, 0', pin_signal: GPIOG10/PWMB_2X/PWMA_2X/XB_IN8}
  - {pin_num: '76', peripheral: TMRB, signal: 'IN, 1', pin_signal: GPIOC13/TA3/XB_IN6/EWM_OUT_B}
  - {pin_num: '76', peripheral: XBARA, signal: 'IN, 6', pin_signal: GPIOC13/TA3/XB_IN6/EWM_OUT_B}
  - {pin_num: '51', peripheral: XBARA, signal: 'IN, 8', pin_signal: GPIOG10/PWMB_2X/PWMA_2X/XB_IN8}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* GPIOB IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOB);
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOE IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOE);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIOG IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOG);
    /* Enable peripheral functionality on pin GPIOA0 (pin 22) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOA0 (pin 22) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_A0_ANA0_and_CMPA_IN3);
    /* Enable peripheral functionality on pin GPIOA1 (pin 23) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA2 (pin 24) */
    GPIO_PinSetPeripheralMode(GPIOA, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB0 (pin 33) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB2 (pin 36) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOB3 (pin 42) */
    GPIO_PinSetPeripheralMode(GPIOB, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_EXTAL_GPIO, BOARD_INITPINS_EXTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_XTAL_GPIO, BOARD_INITPINS_XTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C2_TXD0);
    /* Enable peripheral functionality on pin GPIOC3 (pin 11) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC3 (pin 11) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C3_RXD0);
    /* Enable peripheral functionality on pin GPIOC13 (pin 76) */
    GPIO_PinSetPeripheralMode(GPIOC, kGPIO_Pin13, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC13 (pin 76) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C13_XB_IN6);
    /* Enable peripheral functionality on pin GPIOE0 (pin 68) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin0, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE0 (pin 68) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E0_PWMA_0B);
    /* Enable peripheral functionality on pin GPIOE1 (pin 69) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin1, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE1 (pin 69) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E1_PWMA_0A);
    /* Enable peripheral functionality on pin GPIOE2 (pin 74) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin2, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE2 (pin 74) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E2_PWMA_1B);
    /* Enable peripheral functionality on pin GPIOE3 (pin 75) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin3, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE3 (pin 75) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E3_PWMA_1A);
    /* Enable peripheral functionality on pin GPIOE4 (pin 82) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin4, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE4 (pin 82) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E4_PWMA_2B);
    /* Enable peripheral functionality on pin GPIOE5 (pin 83) */
    GPIO_PinSetPeripheralMode(GPIOE, kGPIO_Pin5, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOE5 (pin 83) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_E5_PWMA_2A);
    /* GPIO functionality on pin GPIOF8 (pin 6) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_LED_R_GPIO, BOARD_INITPINS_LED_R_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF9 (pin 57) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_LED_G_GPIO, BOARD_INITPINS_LED_G_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF10 (pin 56) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_LED_B_GPIO, BOARD_INITPINS_LED_B_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF11 (pin 45) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_LED_Y_GPIO, BOARD_INITPINS_LED_Y_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF15 (pin 46) */
    GPIO_PinSetPeripheralMode(BOARD_INITPINS_SW2_GPIO, BOARD_INITPINS_SW2_PIN_MASK, kGPIO_ModeGpio);
    /* Enable peripheral functionality on pin GPIOG10 (pin 51) */
    GPIO_PinSetPeripheralMode(GPIOG, kGPIO_Pin10, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOG10 (pin 51) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_G10_XB_IN8);

    /* Initialize GPIO functionality on pin GPIOF15 (pin 46)  */
    GPIO_PinSetDirection(BOARD_INITPINS_SW2_GPIO, BOARD_INITPINS_SW2_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF8 (pin 6)  */
    GPIO_PinWrite(BOARD_INITPINS_LED_R_GPIO, BOARD_INITPINS_LED_R_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_INITPINS_LED_R_GPIO, BOARD_INITPINS_LED_R_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF9 (pin 57)  */
    GPIO_PinWrite(BOARD_INITPINS_LED_G_GPIO, BOARD_INITPINS_LED_G_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_INITPINS_LED_G_GPIO, BOARD_INITPINS_LED_G_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF10 (pin 56)  */
    GPIO_PinWrite(BOARD_INITPINS_LED_B_GPIO, BOARD_INITPINS_LED_B_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_INITPINS_LED_B_GPIO, BOARD_INITPINS_LED_B_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF11 (pin 45)  */
    GPIO_PinWrite(BOARD_INITPINS_LED_Y_GPIO, BOARD_INITPINS_LED_Y_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_INITPINS_LED_Y_GPIO, BOARD_INITPINS_LED_Y_PIN_MASK, kGPIO_DigitalOutput);

    /* Interrupt configuration on GPIOF15 (pin 46): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(BOARD_INITPINS_SW2_GPIO, BOARD_INITPINS_SW2_PIN_MASK, kGPIO_InterruptFallingEdge);

    /* Internal Peripheral Select */
    /* Select PWMA Fault 0 Input.: Select PWMA Fault 0 Input, XB_OUT29. */
    SIM_SetInternalPeriInput(SIM, kSIM_PWMAFault0InputIndex, kSIM_PWMAFault0Input_XB_OUT29);
    /* Select TMRB0 Input.: Select TMRB0 Input, XB_OUT34. */
    SIM_SetInternalPeriInput(SIM, kSIM_TMRB0InputIndex, kSIM_TMRB0Input_XB_OUT34);
    /* Select TMRB1 Input.: Select TMRB1 Input, XB_OUT35. */
    SIM_SetInternalPeriInput(SIM, kSIM_TMRB1InputIndex, kSIM_TMRB1Input_XB_OUT35);

    /* PWM Select */
    /* xbar input 28.: xbar input 28, PWMA0_OUT_TRIG0. */
    SIM_SetXbarInputPWMSelection(SIM, kSIM_XBARIN28Index, kSIM_XbarIn28PWMA0OutTrig0);

    /* CMPC_OUT output assigned to XBARA_IN14 input is connected
     * to XBARA_OUT29 output assigned to PWMA_PWMB_FAULT0 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpcOut, kXBARA_OutputPwmaPwmbFault0);
    /* XB_IN8 output assigned to XBARA_IN8 input is connected
     * to XBARA_OUT34 output assigned to TB0_IN */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputXbIn8, kXBARA_OutputTb0In);
    /* XB_IN6 output assigned to XBARA_IN6 input is connected
     * to XBARA_OUT35 output assigned to TB1_IN */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputXbIn6, kXBARA_OutputTb1In);
    /* PWMB0_MUX_PWMA0_OUT_TRIG0 output assigned to XBARA_IN28 input is connected
     * to XBARA_OUT12 output assigned to ADCA_SYNC */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputPwmb0MuxPwma0OutTrig0, kXBARA_OutputAdcaSync);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
